; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city8)
	(= (capacity plane1) 4206)
	(= (fuel plane1) 1229)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 5)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 6)
	(at person1 city5)
	(at person2 city2)
	(at person3 city0)
	(at person4 city9)
	(at person5 city2)
	(at person6 city7)
	(at person7 city9)
	(at person8 city3)
	(at person9 city9)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 541)
	(= (distance city0 city2) 978)
	(= (distance city0 city3) 526)
	(= (distance city0 city4) 533)
	(= (distance city0 city5) 985)
	(= (distance city0 city6) 632)
	(= (distance city0 city7) 726)
	(= (distance city0 city8) 973)
	(= (distance city0 city9) 975)
	(= (distance city1 city0) 541)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 576)
	(= (distance city1 city3) 660)
	(= (distance city1 city4) 633)
	(= (distance city1 city5) 870)
	(= (distance city1 city6) 703)
	(= (distance city1 city7) 618)
	(= (distance city1 city8) 565)
	(= (distance city1 city9) 797)
	(= (distance city2 city0) 978)
	(= (distance city2 city1) 576)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 745)
	(= (distance city2 city4) 631)
	(= (distance city2 city5) 869)
	(= (distance city2 city6) 672)
	(= (distance city2 city7) 870)
	(= (distance city2 city8) 565)
	(= (distance city2 city9) 925)
	(= (distance city3 city0) 526)
	(= (distance city3 city1) 660)
	(= (distance city3 city2) 745)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 742)
	(= (distance city3 city5) 716)
	(= (distance city3 city6) 799)
	(= (distance city3 city7) 529)
	(= (distance city3 city8) 860)
	(= (distance city3 city9) 532)
	(= (distance city4 city0) 533)
	(= (distance city4 city1) 633)
	(= (distance city4 city2) 631)
	(= (distance city4 city3) 742)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 547)
	(= (distance city4 city6) 902)
	(= (distance city4 city7) 511)
	(= (distance city4 city8) 574)
	(= (distance city4 city9) 935)
	(= (distance city5 city0) 985)
	(= (distance city5 city1) 870)
	(= (distance city5 city2) 869)
	(= (distance city5 city3) 716)
	(= (distance city5 city4) 547)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 996)
	(= (distance city5 city7) 706)
	(= (distance city5 city8) 662)
	(= (distance city5 city9) 970)
	(= (distance city6 city0) 632)
	(= (distance city6 city1) 703)
	(= (distance city6 city2) 672)
	(= (distance city6 city3) 799)
	(= (distance city6 city4) 902)
	(= (distance city6 city5) 996)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 682)
	(= (distance city6 city8) 739)
	(= (distance city6 city9) 631)
	(= (distance city7 city0) 726)
	(= (distance city7 city1) 618)
	(= (distance city7 city2) 870)
	(= (distance city7 city3) 529)
	(= (distance city7 city4) 511)
	(= (distance city7 city5) 706)
	(= (distance city7 city6) 682)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 816)
	(= (distance city7 city9) 609)
	(= (distance city8 city0) 973)
	(= (distance city8 city1) 565)
	(= (distance city8 city2) 565)
	(= (distance city8 city3) 860)
	(= (distance city8 city4) 574)
	(= (distance city8 city5) 662)
	(= (distance city8 city6) 739)
	(= (distance city8 city7) 816)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 834)
	(= (distance city9 city0) 975)
	(= (distance city9 city1) 797)
	(= (distance city9 city2) 925)
	(= (distance city9 city3) 532)
	(= (distance city9 city4) 935)
	(= (distance city9 city5) 970)
	(= (distance city9 city6) 631)
	(= (distance city9 city7) 609)
	(= (distance city9 city8) 834)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at person1 city1)
	(at person2 city2)
	(at person3 city2)
	(at person4 city2)
	(at person5 city1)
	(at person6 city4)
	(at person7 city1)
	(at person8 city3)
	(at person9 city3)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane1 city8 city1)
   deleted: (at plane1 city8)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 1130, (fuel plane1) from 1229 to 99
   goals met: 2 of 10
2. (refuel plane1 city1)
   changed: (fuel plane1) from 99 to 4206
   goals met: 2 of 10
3. (fly plane1 city1 city5)
   deleted: (at plane1 city1)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 1130 to 2870, (fuel plane1) from 4206 to 2466
   goals met: 2 of 10
4. (board person1 plane1 city5)
   deleted: (at person1 city5)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 10
5. (fly plane1 city5 city3)
   deleted: (at plane1 city5)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 2870 to 4302, (fuel plane1) from 2466 to 1034
   goals met: 3 of 10
6. (refuel plane1 city3)
   changed: (fuel plane1) from 1034 to 4206
   goals met: 3 of 10
7. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 4302 to 5622, (fuel plane1) from 4206 to 2886
   goals met: 2 of 10
8. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 10
9. (fly plane1 city1 city2)
   deleted: (at plane1 city1)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 5622 to 6774, (fuel plane1) from 2886 to 1734
   goals met: 3 of 10
10. (board person5 plane1 city2)
   deleted: (at person5 city2)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 10
11. (refuel plane1 city2)
   changed: (fuel plane1) from 1734 to 4206
   goals met: 3 of 10
12. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 6774 to 7926, (fuel plane1) from 4206 to 3054
   goals met: 3 of 10
13. (debark person5 plane1 city1)
   deleted: (in person5 plane1)
   added: (at person5 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 10
14. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 7926 to 9008, (fuel plane1) from 3054 to 1972
   goals met: 4 of 10
15. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 10
16. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 9008 to 10060, (fuel plane1) from 1972 to 920
   goals met: 5 of 10
17. (refuel plane1 city3)
   changed: (fuel plane1) from 920 to 4206
   goals met: 5 of 10
18. (fly plane1 city3 city9)
   deleted: (at plane1 city3)
   added: (at plane1 city9)
   changed: (total-fuel-used) from 10060 to 11124, (fuel plane1) from 4206 to 3142
   goals met: 4 of 10
19. (board person4 plane1 city9)
   deleted: (at person4 city9)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 10
20. (board person7 plane1 city9)
   deleted: (at person7 city9)
   added: (in person7 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 4 of 10
21. (board person9 plane1 city9)
   deleted: (at person9 city9)
   added: (in person9 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 4 of 10
22. (fly plane1 city9 city1)
   deleted: (at plane1 city9)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 11124 to 12718, (fuel plane1) from 3142 to 1548
   goals met: 4 of 10
23. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 4 to 3
   goals met: 5 of 10
24. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 12718 to 14038, (fuel plane1) from 1548 to 228
   goals met: 6 of 10
25. (debark person9 plane1 city3)
   deleted: (in person9 plane1)
   added: (at person9 city3)
   changed: (onboard plane1) from 3 to 2
   goals met: 7 of 10
26. (refuel plane1 city3)
   changed: (fuel plane1) from 228 to 4206
   goals met: 7 of 10
27. (fly plane1 city3 city2)
   deleted: (at plane1 city3)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 14038 to 15528, (fuel plane1) from 4206 to 2716
   goals met: 6 of 10
28. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 10
29. (debark person4 plane1 city2)
   deleted: (in person4 plane1)
   added: (at person4 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 10
30. (fly plane1 city2 city7)
   deleted: (at plane1 city2)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 15528 to 17268, (fuel plane1) from 2716 to 976
   goals met: 8 of 10
31. (refuel plane1 city7)
   changed: (fuel plane1) from 976 to 4206
   goals met: 8 of 10
32. (board person6 plane1 city7)
   deleted: (at person6 city7)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 8 of 10
33. (zoom plane1 city7 city4)
   deleted: (at plane1 city7)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 17268 to 19823, (fuel plane1) from 4206 to 1651
   goals met: 8 of 10
34. (debark person6 plane1 city4)
   deleted: (in person6 plane1)
   added: (at person6 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 10
35. (fly plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 19823 to 21307, (fuel plane1) from 1651 to 167
   goals met: 10 of 10
